package variable;

public class Var8 {
    public static void main(String[] args) {
        //실무에서 거의 사용안하면 버리는게 좋다.
        //정수
        byte b = 127; //-128 ~ 127 실무에서 거의 사용안한다. 거의 절약도 안된다. 단 파일 전송이나 파일 복사 등에서는 사용됨.
        short s = 32767; // 표현 길이가 너무 작다. int를 효율적으로 계산하도록 설계되어 있다. byte는 필요할때가 있지만 이건 실무에선 아예 사용 안한다.
        int i = 2147483647; //기본으로 젤 많이 사용한다. (20억)
        long l = 9223372036854775807L; //대문자 L과 소문자 ㅣ 둘다 가능하다. 근데 대문자를 쓰는것이 좋다. 20억이 넘으면 long

        //실수
        float f = 10.0f; //번위가 좀 작음. 소숫점 오류가 많이 발생되어서 실무에서도 아예 안 쓴다.
        double d = 10.0; //기본으로 젤 많이 사용한다.

        //문자
        char c = 'A'; //문자 하나를 표현하는일은 거의 없다. 실무에서 아예 안 쓴다. 쓰더라도 String a = "b" 이렇게 쓰는것이 훨씬 낫다.
        String a = "A"; //기본으로 젤 많이 사용한다.
    }
}
